tests/fixtures/xml/req_csc.xml

<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <nfeCabecMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/CscNFCe">
            <cUF>52</cUF>
            <versaoDados>1.00</versaoDados>
        </nfeCabecMsg>
    </soap:Header>
    <soap:Body>
        <nfeDadosMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/CscNFCe">
            <admCscNFCe versao="1.00" xmlns="http://www.portalfiscal.inf.br/nfe">
                <tpAmb>2</tpAmb>
                <indOp>1</indOp>
                <raizCNPJ>58716523</raizCNPJ>
            </admCscNFCe>
        </nfeDadosMsg>
    </soap:Body>
</soap:Envelope>